gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
    // Return an error if there was no specified file
    if (bpacketCharArray->string[0] == '\0') {
        bpacket_create_sp(bpacket, sender, receiver, WATCHDOG_BPK_R_COPY_FILE, BPACKET_CODE_ERROR,
                          "No file was specified\0");
        esp32_uart_send_bpacket(bpacket);
        return;
    }

    // Max file length is 50
    uint16_t filePathNameSize = chars_get_num_bytes(bpacketCharArray->string);

    if (filePathNameSize > (57)) { // including mount point which is current 7 bytes
        bpacket_create_sp(bpacket, sender, receiver, WATCHDOG_BPK_R_COPY_FILE, BPACKET_CODE_ERROR, "File path > 50\0");
        esp32_uart_send_bpacket(bpacket);
        return;
    }

    char filePath[filePathNameSize + 1]; // add one for null pointer!
    sprintf(filePath, "%s/", MOUNT_POINT_PATH);
    int i = 0;
    for (i = 0; i < filePathNameSize; i++) {
        filePath[i + 8] = bpacketCharArray->string[i];
    }
    filePath[i + 8] = '\0'; // Add null terminator

    // char* filePath = bpacketCharArray->string;

    // char fullPath[MAX_PATH_LENGTH];
    // sprintf(fullPath, "%s/%s", MOUNT_POINT_PATH, filePath);
    FILE* file = fopen(filePath, "rb"); // read binary file

    if (file == NULL) {
        char msg[100];
        sprintf(msg, "File was NULL: [%i] [%s] => [%s]", filePathNameSize, filePath, strerror(errno));
        bpacket_create_sp(bpacket, sender, receiver, WATCHDOG_BPK_R_COPY_FILE, BPACKET_CODE_ERROR, msg);
        esp32_uart_send_bpacket(bpacket);
        return;
    }

    // Get the size of the file in bytes
    fseek(file, 0L, SEEK_END);
    uint32_t fileNumBytes = ftell(file);
    fseek(file, 0L, SEEK_SET);

    bpacket_t bpacket1;
    bpacket_buffer_t bpacketBuffer1;
    bpacket_create_sp(&bpacket1, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_ESP32, BPACKET_GEN_R_MESSAGE,
                      BPACKET_CODE_SUCCESS, "About to send image");
    bpacket_to_buffer(&bpacket1, &bpacketBuffer1);
    esp32_uart_send_bpacket(&bpacket1);

    // Change the values of the bpacket so they get sent to Maple
    bpacket->sender   = BPACKET_ADDRESS_ESP32;
    bpacket->receiver = BPACKET_ADDRESS_MAPLE;
    bpacket->code     = BPACKET_CODE_IN_PROGRESS;
    bpacket->request  = WATCHDOG_BPK_R_COPY_FILE;
    bpacket->numBytes = BPACKET_MAX_NUM_DATA_BYTES;
    int pi            = 0;
    for (uint32_t i = 0; i < fileNumBytes; i++) {

        bpacket->bytes[pi++] = fgetc(file);

        if (pi < BPACKET_MAX_NUM_DATA_BYTES && (i + 1) != fileNumBytes) {
            continue;
        }

        if ((i + 1) == fileNumBytes) {
            bpacket->code     = BPACKET_CODE_SUCCESS;
            bpacket->numBytes = pi--;
        }

        esp32_uart_send_bpacket(bpacket);

        pi = 0;
    }

    fclose(file);

    // Close the SD card
    sd_card_close();
}

uint8_t sd_card_write_watchdog_settings(bpacket_t* bpacket) {

    uint8_t request  = bpacket->request;
    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "SD card failed to open\0");
        return FALSE;
    }

    // Confirm file path exists. Create it if it does not
    FILE* file = fopen(SETTINGS_FILE_PATH_START_AT_ROOT, "wb"); // write binary file
    if (file == NULL) {
        char msg[70];
        sprintf(msg, "Failed to open '%s' for writing. Error: %s", SETTINGS_FILE_PATH_START_AT_ROOT, strerror(errno));
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, msg);
        return FALSE;
    }

    // Rewrite bytes file in the same order as the bpacket for simplicity
    for (int i = 0; i < bpacket->numBytes; i++) {
        fputc(bpacket->bytes[i], file);
    }

    // Clean up
    fclose(file);
    sd_card_close();

    // Update bapacket to send as success response back
    bpacket->numBytes = 0;
    bpacket->receiver = sender;
    bpacket->sender   = receiver;
    bpacket->code     = BPACKET_CODE_SUCCESS;

    return TRUE;
}

uint8_t sd_card_read_watchdog_settings(bpacket_t* bpacket) {

    uint8_t request  = bpacket->request;
    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "SD card failed to open\0");
        return FALSE;
    }

    FILE* file = fopen(SETTINGS_FILE_PATH_START_AT_ROOT, "rb"); // read binary file
    if (file == NULL) {
        char msg[70];
        sprintf(msg, "Failed to open '%s'. Error: %s", SETTINGS_FILE_PATH_START_AT_ROOT, strerror(errno));
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, msg);
        return FALSE;
    }

    // Calculate the length of the file
    fseek(file, 0L, SEEK_END);
    bpacket->numBytes = ftell(file);
    fseek(file, 0L, SEEK_SET);

    // If the file is empty, return error
    if (bpacket->numBytes == 0) {
        char msg[70];
        sprintf(msg, "File '%s' was empty.", SETTINGS_FILE_PATH_START_AT_ROOT);
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, msg);
        fclose(file);
        return FALSE;
    }

    // Rewrite bytes file in the same order as the bpacket for simplicity
    for (int i = 0; i < bpacket->numBytes; i++) {
        bpacket->bytes[i] = fgetc(file);
    }

    // Clean up
    fclose(file);
    sd_card_close();

    bpacket->receiver = sender;
    bpacket->sender   = receiver;
    bpacket->code     = BPACKET_CODE_SUCCESS;

    return TRUE;
}

/* GOOD FUNCTIONS */

uint8_t sd_card_open(void) {

    // Return if the sd card has already been mounted
    if (mounted != FALSE) {
        return TRUE;
    }

    sdmmc_host_t host = SDMMC_HOST_DEFAULT();

    // This initializes the slot without card detect (CD) and write protect (WP) signals.
    // Modify slot_config.gpio_cd and slot_config.gpio_wp if your board has these signals.
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    slot_config.width               = 1;

    // Enable internal pullups on enabled pins. The internal pullups
    // are insufficient however, please make sure 10k external pullups are
    // connected on the bus. This is for debug / example purpose only.
    slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;

    // Mount the SD card
    esp_err_t ret = esp_vfs_fat_sdmmc_mount(MOUNT_POINT_PATH, &host, &slot_config, &sdCardConfiguration, &card);

    if (ret != ESP_OK) {

        if (ret == ESP_FAIL) {
            ESP_LOGE(SD_CARD_TAG, "Please reformat SD card");
            return SD_CARD_ERROR_UNREADABLE_CARD;
        }

